InformationRegisters/КодыЦентральногоСправочника.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>КодыЦентральногоСправочника</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>КодЦС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КодыЦентральногоСправочника/Ext/ManagerModule.bsl
Процедура СформироватьКодЦС(Источник) Экспорт
	Перем Номенклатура, Характеристика;
	
	Если ТипЗнч(Источник) = Тип("СправочникОбъект.Номенклатура") Тогда
		Номенклатура = Источник.Ссылка;
		Характеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	ИначеЕсли ТипЗнч(Источник) = Тип("СправочникОбъект.ХарактеристикиНоменклатуры") Тогда
		Номенклатура 	= Источник.Владелец;
		Характеристика 	= Источник.Ссылка;
	Иначе
		Возврат;
	КонецЕсли;
	
	Если Номенклатура.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;	
	
	Если НетКодаЦС(Номенклатура, Характеристика) Тогда	
		
		МаксКод = ПолучитьМаксимальноеЗначениеКодовЦС();
		
		Код = ПолучитьКодЦС(МаксКод);
		
		МенеджерЗаписи 					= РегистрыСведений.КодыЦентральногоСправочника.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.КодЦС 			= Код;
		МенеджерЗаписи.Номенклатура 	= Номенклатура;
		МенеджерЗаписи.Характеристика 	= Характеристика;
		МенеджерЗаписи.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

Функция НетКодаЦС(Номенклатура, Характеристика)

		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КодыЦентральногоСправочника.КодЦС
		|ИЗ
		|	РегистрСведений.КодыЦентральногоСправочника КАК КодыЦентральногоСправочника
		|ГДЕ
		|	КодыЦентральногоСправочника.Номенклатура = &Номенклатура
		|	И КодыЦентральногоСправочника.Характеристика = &Характеристика";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	

КонецФункции // ()


Функция ПолучитьМаксимальноеЗначениеКодовЦС()

	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(КодыЦентральногоСправочника.КодЦС) КАК КодЦС
		|ИЗ
		|	РегистрСведений.КодыЦентральногоСправочника КАК КодыЦентральногоСправочника";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.КодЦС;
	Иначе
		Возврат 00000;
	КонецЕсли;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	

КонецФункции // ()

Функция ПолучитьКодЦС(МаксКод)

	Номер = СтроковыеФункцииКлиентСервер.УдалитьПовторяющиесяСимволы(МаксКод, "0");	

	Если Не ЗначениеЗаполнено(Номер) Тогда
		НовыйКод = 1;
	Иначе
		НовыйКод = СтрЗаменить(Строка(Число(Номер) + 1),Символы.НПП,"");
	КонецЕсли;	
	
	Возврат ДобавитьЛидирующиеНули(НовыйКод, 5);
	
КонецФункции // ()

Функция ДобавитьЛидирующиеНули(Знач Строка, Знач ДлиннаСтроки) 
	
	ТекстПолный = Строка;
	Пока СтрДлина(ТекстПолный) < ДлиннаСтроки Цикл
		ТекстПолный = "0" + ТекстПолный;
	КонецЦикла;
	          
	Возврат ТекстПолный;
	
КонецФункции
